---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Rotation
source: html/f17923f2-8eec-41ed-8d83-0d5253342a92.htm
---
# Autodesk.Revit.DB.SpecTypeId.Rotation Property

Rotation, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId Rotation { get; }
```